###  Part # 1
  #### Terraform Format and Style 🖌`failure`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/432b72c3-cbcb-406e-9217-d4a95b525017/terraform-bin show -no-color tf.plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apigatewayv2_api.api will be created
  + resource "aws_apigatewayv2_api" "api" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "EC2ControlAPI"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # aws_apigatewayv2_integration.lambda_integration will be created
  + resource "aws_apigatewayv2_integration" "lambda_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.route will be created
  + resource "aws_apigatewayv2_route" "route" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /"
      + target             = (known after apply)
    }

  # aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ec2_control_lambda_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.lambda_policy will be created
  + resource "aws_iam_role_policy" "lambda_policy" {
      + id          = (known after apply)
      + name        = "ec2_control_policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:StartInstances",
                          + "ec2:StopInstances",
                          + "ec2:DescribeInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_lambda_function.ec2_control will be created
  + resource "aws_lambda_function" "ec2_control" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "lambda_function.py"
      + function_name                  = "EC2_Control_Lambda"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)
    }

  # aws_lambda_permission.api_lambda_permission will be created
  + resource "aws_lambda_permission" "api_lambda_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "EC2_Control_Lambda"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # local_file.lambda_src will be created
  + resource "local_file" "lambda_src" {
      + content              = <<-EOT
            import json
            import boto3
            import os
            
            ec2 = boto3.client("ec2")
            
            TAG_KEY = "Environment"
            TAG_VALUE = "Dev"
            
            def list_instances():
                resp = ec2.describe_instances(
                    Filters=[{"Name": f"tag:{TAG_KEY}", "Values": [TAG_VALUE]}]
                )
                instances = []
                for r in resp["Reservations"]:
                    for i in r["Instances"]:
                        name = next((t["Value"] for t in i.get("Tags", []) if t.get("Key") == "Name"), i.get("InstanceId"))
                        instances.append({"id": i["InstanceId"], "name": name, "state": i["State"]["Name"]})
                return instances
            
            def get_instance(instance_id):
                resp = ec2.describe_instances(InstanceIds=[instance_id])
                for r in resp["Reservations"]:
                    for i in r["Instances"]:
                        return i
                return None
            
            def lambda_handler(event, context):
                print("EVENT:", json.dumps(event))
            
                action = event.get("action")
                instance_id = event.get("instance_id")
            
                if action == "list":
                    return {"statusCode": 200, "body": json.dumps(list_instances())}
            
                if not instance_id:
                    return {"statusCode": 400, "body": json.dumps({"error": "No instance id provided"})}
            
                if action == "start":
                    ec2.start_instances(InstanceIds=[instance_id])
                    return {"statusCode": 200, "body": json.dumps({"message": f"Started {instance_id}"})}
            
                if action == "stop":
                    ec2.stop_instances(InstanceIds=[instance_id])
                    return {"statusCode": 200, "body": json.dumps({"message": f"Stopped {instance_id}"})}
            
                return {"statusCode": 400, "body": json.dumps({"error": "Invalid action"})}
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "lambda_function.py"
      + id                   = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_endpoint = (known after apply)
  + api_url      = (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_apigatewayv2_api.api will be created%0A  + resource "aws_apigatewayv2_api" "api" {%0A      + api_endpoint                 = (known after apply)%0A      + api_key_selection_expression = "$request.header.x-api-key"%0A      + arn                          = (known after apply)%0A      + execution_arn                = (known after apply)%0A      + id                           = (known after apply)%0A      + name                         = "EC2ControlAPI"%0A      + protocol_type                = "HTTP"%0A      + route_selection_expression   = "$request.method $request.path"%0A      + tags_all                     = (known after apply)%0A    }%0A%0A  # aws_apigatewayv2_integration.lambda_integration will be created%0A  + resource "aws_apigatewayv2_integration" "lambda_integration" {%0A      + api_id                                    = (known after apply)%0A      + connection_type                           = "INTERNET"%0A      + id                                        = (known after apply)%0A      + integration_response_selection_expression = (known after apply)%0A      + integration_type                          = "AWS_PROXY"%0A      + integration_uri                           = (known after apply)%0A      + payload_format_version                    = "2.0"%0A      + timeout_milliseconds                      = (known after apply)%0A    }%0A%0A  # aws_apigatewayv2_route.route will be created%0A  + resource "aws_apigatewayv2_route" "route" {%0A      + api_id             = (known after apply)%0A      + api_key_required   = false%0A      + authorization_type = "NONE"%0A      + id                 = (known after apply)%0A      + route_key          = "POST /"%0A      + target             = (known after apply)%0A    }%0A%0A  # aws_iam_role.lambda_role will be created%0A  + resource "aws_iam_role" "lambda_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "lambda.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "ec2_control_lambda_role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy.lambda_policy will be created%0A  + resource "aws_iam_role_policy" "lambda_policy" {%0A      + id          = (known after apply)%0A      + name        = "ec2_control_policy"%0A      + name_prefix = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "ec2:StartInstances",%0A                          + "ec2:StopInstances",%0A                          + "ec2:DescribeInstances",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + role        = (known after apply)%0A    }%0A%0A  # aws_lambda_function.ec2_control will be created%0A  + resource "aws_lambda_function" "ec2_control" {%0A      + architectures                  = (known after apply)%0A      + arn                            = (known after apply)%0A      + filename                       = "lambda_function.py"%0A      + function_name                  = "EC2_Control_Lambda"%0A      + handler                        = "lambda_function.lambda_handler"%0A      + id                             = (known after apply)%0A      + invoke_arn                     = (known after apply)%0A      + last_modified                  = (known after apply)%0A      + memory_size                    = 128%0A      + package_type                   = "Zip"%0A      + publish                        = false%0A      + qualified_arn                  = (known after apply)%0A      + qualified_invoke_arn           = (known after apply)%0A      + reserved_concurrent_executions = -1%0A      + role                           = (known after apply)%0A      + runtime                        = "python3.12"%0A      + signing_job_arn                = (known after apply)%0A      + signing_profile_version_arn    = (known after apply)%0A      + skip_destroy                   = false%0A      + source_code_hash               = (known after apply)%0A      + source_code_size               = (known after apply)%0A      + tags_all                       = (known after apply)%0A      + timeout                        = 3%0A      + version                        = (known after apply)%0A    }%0A%0A  # aws_lambda_permission.api_lambda_permission will be created%0A  + resource "aws_lambda_permission" "api_lambda_permission" {%0A      + action              = "lambda:InvokeFunction"%0A      + function_name       = "EC2_Control_Lambda"%0A      + id                  = (known after apply)%0A      + principal           = "apigateway.amazonaws.com"%0A      + source_arn          = (known after apply)%0A      + statement_id        = "AllowAPIGatewayInvoke"%0A      + statement_id_prefix = (known after apply)%0A    }%0A%0A  # local_file.lambda_src will be created%0A  + resource "local_file" "lambda_src" {%0A      + content              = <<-EOT%0A            import json%0A            import boto3%0A            import os%0A            %0A            ec2 = boto3.client("ec2")%0A            %0A            TAG_KEY = "Environment"%0A            TAG_VALUE = "Dev"%0A            %0A            def list_instances():%0A                resp = ec2.describe_instances(%0A                    Filters=[{"Name": f"tag:{TAG_KEY}", "Values": [TAG_VALUE]}]%0A                )%0A                instances = []%0A                for r in resp["Reservations"]:%0A                    for i in r["Instances"]:%0A                        name = next((t["Value"] for t in i.get("Tags", []) if t.get("Key") == "Name"), i.get("InstanceId"))%0A                        instances.append({"id": i["InstanceId"], "name": name, "state": i["State"]["Name"]})%0A                return instances%0A            %0A            def get_instance(instance_id):%0A                resp = ec2.describe_instances(InstanceIds=[instance_id])%0A                for r in resp["Reservations"]:%0A                    for i in r["Instances"]:%0A                        return i%0A                return None%0A            %0A            def lambda_handler(event, context):%0A                print("EVENT:", json.dumps(event))%0A            %0A                action = event.get("action")%0A                instance_id = event.get("instance_id")%0A            %0A                if action == "list":%0A                    return {"statusCode": 200, "body": json.dumps(list_instances())}%0A            %0A                if not instance_id:%0A                    return {"statusCode": 400, "body": json.dumps({"error": "No instance id provided"})}%0A            %0A                if action == "start":%0A                    ec2.start_instances(InstanceIds=[instance_id])%0A                    return {"statusCode": 200, "body": json.dumps({"message": f"Started {instance_id}"})}%0A            %0A                if action == "stop":%0A                    ec2.stop_instances(InstanceIds=[instance_id])%0A                    return {"statusCode": 200, "body": json.dumps({"message": f"Stopped {instance_id}"})}%0A            %0A                return {"statusCode": 400, "body": json.dumps({"error": "Invalid action"})}%0A        EOT%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "lambda_function.py"%0A      + id                   = (known after apply)%0A    }%0A%0APlan: 8 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + api_endpoint = (known after apply)%0A  + api_url      = (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @jangama3, Action: `pull_request`, Workflow: `Terraform`*